Table of Contents
 Class IdeaMaterialByName
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaMaterialByName : AbstractIdeaObject<IIdeaMaterialByName>, IEquatable<AbstractIdeaObject<IIdeaMaterialByName>>, IIdeaMaterialByName, IIdeaMaterial, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaMaterialByName>
IdeaMaterialByName
Implements
IEquatable<AbstractIdeaObject<IIdeaMaterialByName>>
IIdeaMaterialByName
IIdeaMaterial
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaMaterialByName>.Id
 AbstractIdeaObject<IIdeaMaterialByName>.Name
 AbstractIdeaObject<IIdeaMaterialByName>.Identifier
 AbstractIdeaObject<IIdeaMaterialByName>.GetHashCode()
 AbstractIdeaObject<IIdeaMaterialByName>.Equals(object)
 AbstractIdeaObject<IIdeaMaterialByName>.Equals(AbstractIdeaObject<IIdeaMaterialByName>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaMaterialByName(Identifier<IIdeaMaterialByName>)
public IdeaMaterialByName(Identifier<IIdeaMaterialByName> identifer)
Parameters
identifer Identifier<IIdeaMaterialByName>
 IdeaMaterialByName(int)
public IdeaMaterialByName(int id)
Parameters
id int
 IdeaMaterialByName(string)
public IdeaMaterialByName(string id)
Parameters
id string
Properties
 MaterialType
Material type
public virtual MaterialType MaterialType { get; set; }
Property Value
MaterialType
 Edit this page